Инвестиции_1С/src/Documents/ДИ_Сделка/ДИ_Сделка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДИ_Сделка</name>
  <registerRecords>AccumulationRegister.ДИ_ПартииЦенныхБумаг</registerRecords>
  <registerRecords>AccumulationRegister.ДИ_ОстаткиЦенныхБумаг</registerRecords>
  <registerRecords>AccumulationRegister.ДИ_РеализованныеПрибылиУбытки</registerRecords>
  <registerRecords>AccumulationRegister.ДИ_ДенежныеСредстваПортфелей</registerRecords>
  <attributes>
    <name>ВидСделки</name>
    <type>
      <types>EnumRef.ДИ_ВидСделки</types>
    </type>
  </attributes>
  <attributes>
    <name>Портфель</name>
    <type>
      <types>CatalogRef.ДИ_Портфели</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаСделки</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСделки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Активы</name>
    <attributes>
      <name>ЦеннаяБумага</name>
      <type>
        <types>CatalogRef.ДИ_ЦенныеБумаги</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомиссияБрокераПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомиссияБрокераСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасчетов</name>
      <comment>Сумма + Комиссия брокера</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Инвестиции_1С/src/Documents/ДИ_Сделка/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидСделкиПриИзменении(Элемент)
	ВидСделкиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПортфельПриИзменении(Элемент)
	ПортфельПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВалютаСделкиПриИзменении(Элемент)
	УстановитьВидимостьДоступность()
КонецПроцедуры

&НаКлиенте
Процедура СпискомПриИзменении(Элемент)
	УстановитьВидимостьДоступность()
КонецПроцедуры

&НаКлиенте
Процедура Списком1ПриИзменении(Элемент)
	УстановитьВидимостьДоступность()
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВидСделкиПриИзмененииНаСервере()
	СформироватьЗаголовок();
КонецПроцедуры


&НаСервере
Процедура ПортфельПриИзмененииНаСервере()
	СформироватьЗаголовок();
КонецПроцедуры


&НаСервере
Процедура СформироватьЗаголовок()
	
	Заголовок = СтрШаблон("%1: %2 [%3] №%4 от %5",
	 ?(ЗначениеЗАполнено(Объект.Ссылка), ?(Модифицированность, "Редактирование сделки", "Просмотр сделки"), "Добавление сделки"),
	  Объект.ВидСделки,
	  Объект.Портфель,
	  Объект.Номер,
	  Формат(Объект.ДатаСделки, "ДЛФ=Д"));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	Элементы.КурсВалюты.Видимость = (Объект.ВалютаСделки <> Объект.Портфель.ВалютаСделки);
	Элементы.Активы.Видимость = Списком;
	Элементы.ОдинАктив.Видимость = НЕ Списком;
КонецПроцедуры

#КонецОбласти
